Repository: meshwallet/Mesh-Wallet
Catalog: mobile/ios/Mesh/Localizable.xcstrings
Source language: en
Languages: ar, es, id, ru, tr, vi, zh_hans

# transfer.proof.received.with.mesh
source: Received with Mesh
ar: تم الاستلام عبر Mesh
zh_hans: 通过 Mesh 收到

# transfer.proof.screenshot.hint
source: Screenshot saved. Tap Share proof for a clean receipt.
ar: تم حفظ لقطة الشاشة. اضغط مشاركة الإثبات للحصول على إيصال نظيف.
zh_hans: 截图已保存。点击分享凭证获取干净收据。

# transfer.proof.sent.with.mesh
source: Sent with Mesh
ar: تم الإرسال عبر Mesh
zh_hans: 通过 Mesh 发送

# transfer.proof.share
source: Share proof
ar: مشاركة الإثبات
zh_hans: 分享凭证

# transfer.proof.share.image
source: Image receipt
ar: إيصال صورة
zh_hans: 图片收据

# transfer.proof.share.text
source: Text receipt
ar: إيصال نصي
zh_hans: 文字收据

# transfer.proof.status
source: Status
ar: الحالة
zh_hans: 状态

# transfer.proof.tagline
source: USDT without TRX
ar: USDT بدون TRX
zh_hans: 无需 TRX 的 USDT

# transfer.proof.to
source: To
ar: إلى
zh_hans: 至

# transfer.proof.transfer.received
source: Transfer received
ar: تم استلام التحويل
zh_hans: 收到转账

# transfer.proof.transfer.sent
source: Transfer sent
ar: تم إرسال التحويل
zh_hans: 发送转账

# transfer.proof.tx
source: Tx
ar: المعاملة
zh_hans: 交易

# transfer.proof.view.tronscan
source: View on Tronscan
ar: عرض على Tronscan
zh_hans: 在 Tronscan 上查看

source: Wallet name
ar: اسم المحفظة
zh_hans: 钱包名称

# wallet.activity
source: Activity
ar: النشاط
es: Actividad
id: Aktivitas
tr: Hareketler
vi: Hoạt động
zh_hans: 活动

# wallet.activity.empty
source: No transactions yet
ar: لا توجد معاملات بعد
es: Aún no hay transacciones
id: Belum ada transaksi
tr: Henüz işlem yok
vi: Chưa có giao dịch
zh_hans: 暂无交易

# wallet.activity.filter.all
source: All
ar: الكل
es: Todo
id: Semua
tr: Tümü
vi: Tất cả
zh_hans: 全部

# wallet.activity.filter.received
source: Received
ar: مستلم
es: Recibido
id: Diterima
tr: Alınan
vi: Đã nhận
zh_hans: 已收到

# wallet.activity.filter.sent
source: Sent
ar: مُرسَل
es: Enviado
id: Terkirim
tr: Gönderilen
vi: Đã gửi
zh_hans: 已发送

# wallet.address.drawer.activation.active
source: USDT balance at least 1
ar: رصيد USDT على الأقل 1
ru: Баланс USDT от 1
zh_hans: USDT 余额至少 1

# wallet.address.drawer.activation.inactive
source: Less than 1 USDT
ar: أقل من 1 USDT
ru: Меньше 1 USDT
zh_hans: 少于 1 USDT

# wallet.address.drawer.create.action
source: Create
ar: إنشاء
zh_hans: 创建

# wallet.address.drawer.create.hint
source: Backed up by the same recovery phrase
ar: مدعوم بنفس عبارة الاسترداد
es: Respaldo con la misma frase de recuperación
id: Dicadangkan dengan frasa pemulihan yang sama
ru: Та же фраза восстановления для резервной копии
tr: Aynı kurtarma ifadesiyle yedeklenir
vi: Sao lưu bằng cụm khôi phục giống nhau
zh_hans: 由同一恢复短语备份

# wallet.address.drawer.create.placeholder
source: Account name
ar: اسم الحساب
ru: Название аккаунта
zh_hans: 账户名称

# wallet.address.drawer.create.title
source: Name this account
ar: سمّ هذا الحساب
ru: Название аккаунта
zh_hans: 命名此账户

# wallet.address.drawer.main.badge
source: Main
ar: رئيسي
zh_hans: 主

# wallet.address.drawer.rename.accessibility
source: Rename account
ar: إعادة تسمية الحساب
ru: Переименовать аккаунт
zh_hans: 重命名账户

# wallet.address.drawer.rename.action
source: Save
ar: حفظ
ru: Сохранить
zh_hans: 保存

# wallet.address.drawer.rename.title
source: Rename account
ar: إعادة تسمية الحsاب
ru: Переименовать аккаунт
zh_hans: 重命名账户

# wallet.address.drawer.subtitle
source: Up to 5 accounts per wallet
ar: حتى 5 حسابات لكل محفظة
es: Hasta 5 cuentas por billetera
id: Hingga 5 akun per dompet
ru: До 5 аккаунтов на кошелёк
tr: Cüzdan başına en fazla 5 hesap
vi: Tối đa 5 tài khoản mỗi ví
zh_hans: 每个钱包最多 5 个账户

# wallet.address.drawer.title
source: Accounts
ar: الحسابات
es: Cuentas
id: Akun
ru: Аккаунты
tr: Hesaplar
vi: Tài khoản
zh_hans: 账户

# wallet.address.drawer.total.label
source: Total
ar: الإجمالي
ru: Всего
zh_hans: 总计

# wallet.balance.breakdown
source: Show balance by address
ar: عرض الرصيد حسب العنوان
zh_hans: 按地址显示余额

# wallet.balance.hidden
source: Balance hidden
ar: الرصيد مخفي
es: Saldo oculto
id: Saldo disembunyikan
tr: Bakiye gizli
vi: Số dư đã ẩn
zh_hans: 余额已隐藏

# wallet.fund
source: Fund your wallet
ar: موّل محفظتك
es: Fondear tu billetera
id: Isi dompet Anda
tr: Cüzdanınıza fon yatırın
vi: Nạp ví của bạn
zh_hans: 为钱包充值

# wallet.home.total.amount.label
source: Total amount:
ar: المبلغ الإجمالي:
ru: Общая сумма:
zh_hans: 总金额：

# wallet.other.addresses
source: Other addresses
ar: عناوين أخرى
zh_hans: 其他地址

# wallet.receive
source: Receive
ar: استلام
es: Recibir
id: Terima
tr: Al
vi: Nhận
zh_hans: 收款

# wallet.select.add.existing
source: Add existing
ar: إضافة موجودة
es: Añadir existente
id: Tambah yang ada
tr: Mevcut ekle
vi: Thêm hiện có
zh_hans: 添加现有

# wallet.select.create.new
source: Create new
ar: إنشاء جديدة
es: Crear nueva
id: Buat baru
tr: Yeni oluştur
vi: Tạo mới
zh_hans: 创建新钱包

# wallet.select.menu.backup
source: Backup
ar: نسخة احتياطية
es: Respaldo
id: Cadangan
tr: Yedek
vi: Sao lưu
zh_hans: 备份

# wallet.select.menu.remove
source: Remove
ar: إزالة
es: Eliminar
id: Hapus
tr: Kaldır
vi: Xóa
zh_hans: 移除

# wallet.select.menu.rename
source: Rename
ar: إعادة تسمية
es: Renombrar
id: Ganti nama
tr: Yeniden adlandır
vi: Đổi tên
zh_hans: 重命名

# wallet.select.title
source: Select wallet
ar: اختر المحفظة
es: Seleccionar billetera
id: Pilih dompet
tr: Cüzdan seç
vi: Chọn ví
zh_hans: 选择钱包

# wallet.send
source: Send
ar: إرسال
es: Enviar
id: Kirim
tr: Gönder
vi: Gửi
zh_hans: 发送

# wallet.today
source: Today
ar: اليوم
es: Hoy
id: Hari ini
tr: Bugün
vi: Hôm nay
zh_hans: 今天

# welcome.create
source: Create new wallet
ar: إنشاء محفظة جديدة
es: Crear nueva billetera
id: Buat dompet baru
tr: Yeni cüzdan oluştur
vi: Tạo ví mới
zh_hans: 创建新钱包

# welcome.legal.prefix
source: By tapping any button you agree and consent to our
ar: بالضغط على أي زر، فإنك توافق وتوافق على
es: Al tocar cualquier botón, aceptas nuestros
id: Dengan mengetuk tombol apa pun, Anda setuju dengan
tr: Herhangi bir düğmeye dokunarak şunları kabul etmiş olursunuz:
vi: Khi nhấn bất kỳ nút nào, bạn đồng ý với
zh_hans: 点击任意按钮即表示你同意并接受我们的

# welcome.legal.privacy
source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
id: Kebijakan Privasi
tr: Gizlilik Politikası
vi: Chính sách quyền riêng tư
zh_hans: 隐私政策

# welcome.legal.terms
source: Terms of Service
ar: شروط الخدمة
es: Términos de servicio
id: Ketentuan Layanan
tr: Hizmet Şartları
vi: Điều khoản dịch vụ
zh_hans: 服务条款

# welcome.restore
source: I already have a wallet
ar: لدي محفظة بالفعل
es: Ya tengo una billetera
id: Saya sudah punya dompet
tr: Zaten bir cüzdanım var
vi: Tôi đã có ví
zh_hans: 我已有钱包

# welcome.tagline
source: Self-custody USDT on Tron. Your keys stay on this device.
ar: USDT ذاتية الحفظ على Tron. مفاتيحك تبقى على هذا الجهاز.
es: USDT en autocustodia en Tron. Tus claves permanecen en este dispositivo.
id: USDT self-custody di Tron. Kunci Anda hanya ada di perangkat ini.
tr: Tron üzerinde self-custody USDT. Anahtarlarınız yalnızca bu cihazda kalır.
vi: USDT self-custody trên Tron. Khóa của bạn chỉ lưu trên thiết bị này.
zh_hans: Tron 上的自托管 USDT。 你的密钥保留在此设备上。
